{
  "home": "Home",
  "music": "Music Collection",
  "video": "Video Collection",
  "merch": "Merch",
  "about": "About",
  "contact": "Contact",
  "musicCollection":{
    "albums": "Albums",
    "singles": "Singles"
  },
  "musicCollectionAlbum":{
    "stillChildishContent":"Not just immaturity, but a choice—to keep rebellion and wonder pure.\nThis is a chronicle of a growth unwilling to forget,\na journey through nights and rain in a reckless city,\nthrough relationships, doubt, dreams, and lies,\nonly to return to the self who never stopped being curious,\nnever stopped being sincere.\nI’m learning to become a grown-up,\nbut I refuse to let my childlike heart rot in reality.\nEven if this world teaches me composure, distance, and silence,\nI still choose passion, chaos, and truth.\nIt’s not that I haven’t grown up—I’ve simply chosen not to forget.\nProduced by Seven Dollars 七元\nFeaturing: Moonchild, Drordie, Tdot",
    "spuTitle": "SEVEN DOLLARS - Stars, Planet, Universe",
    "spuContent": "\"A soul ritual woven from stars and tears — a deep dive into fate, dreams, and the true self.\"\n\nIn the depths of the stars, dreams whisper and hearts pulse.\nThis is more than an album — it's a journey into the subconscious, reaching the edge of the universe.\n\n*Stars, Planet, Universe* takes 'dream' as its guiding thread,\nescaping, falling, resisting, and finally confronting nightmares to complete the self.\nThe intro, \"Stars, Planet, Universe,\" opens the dreamscape in collaboration with Moonchild;\n\"Stay with you\" and \"Heartbeats\" capture fleeting moments of infatuation and desire;\n\"Player One\" explores the self ensnared by temptation.\n\nIn the middle act, \"Dream in Charge\" and \"The Tenth Planet\" lead listeners beyond gravity,\ntoward the outer realms of imagination.\n\"The Demon After the Nightmare\" and \"The End Of The World\"\nreveal the darkness lurking behind dreams and myths of destruction.\n\nThe final chapter, *The Dream Completion Plan*, includes the dual tracks \"Catastrophe\" and \"Rebirth\",\nsymbolizing the cycle’s closure.\nWhen dreams collapse, can we rise again from their ruins?\nYou'll find this is more than a sonic experience — it’s a meditation on existence itself.\nProduced by Seven Dollars 七元\nFeaturing: Moonchild, Little Q",
    "oceanTitle": "SEVEN DOLLARS - Ocean",
    "oceanContent": "\"Ocean\" is a sonic journey through sinking consciousness, emotional escape, and the emergence of love.\nFrom the opening track \"Mind (Intro),\" the listener is pulled into a deep dive where thoughts and sounds intertwine.\n\"Surfing\" captures the struggle to stay balanced,\nwhile \"Pits and Holes\" and \"Stranded\" explore chapters of hurt and emotional stagnation.\n\nThen comes the fifth track, \"Meteor (ft. Moonchild),\" where light pierces the deep sea.\nA radiant love song, it lands like a meteor into dark waters, yet lights up the entire abyss.\nThis love is not salvation, but the act of finding direction in shared disorientation —\nthe brightest moment of the album.\n\n\"Take Away\" follows with the echo of gratitude — both a farewell and a keepsake.\n\"13k Feet Under\" and \"Deeper\" plunge again into inner depths.\n\"2AM\" releases what’s been repressed, a midnight confession of the soul.\nAnd the final track, \"Abyss,\" isn’t an end but a surrender:\neven if the heart sinks like the sea, I still remember the star that once lit my world."
  },
  "videoCollection":{
    "funny": "Funny Videos & Reels",
    "music": "Music Videos & Reels",
    "dance": "Dance Videos & Reels",
    "food": "About Cooking",
    "other": "Other Types of Videos & Reels"
  },
  "aboutContent":{
    "intro": "Hello, I'm Seven Dollars, aka the Hip-Hop Engineer.\nI'm a rapper, software engineer, and music producer.\nI grew up surrounded by music, inspired early on by Linkin Park and Eminem,\nand later shaped by artists like Kendrick Lamar and Juice WRLD.\nMy work blends emotional storytelling with genre-blending sounds,\nflowing between Mandarin and English lyrics.\nI use both music and technology to express inner thoughts\nand connect with listeners on a deeper level.",
    "partTwo": "Since 2018, I've been self-taught in songwriting, production, mixing, and arrangement. My music spans diverse styles, often blending Mandarin and English lyrics with stream-of-consciousness storytelling.\nI explore different vocal tones to express raw emotion in every track.\n My goal is to connect with listeners worldwide and collaborate with international artists.\nRecently, I've been building my brand through short-form video content on Reels, TikTok, and YouTube Shorts, with one skateboarding clip going viral overseas.",
    "partThree": "On 2020/12/25, Officially released my second album *Ocean* on all major streaming platforms.\nOn 2023/05/19,  released my third album *Stars, Planet, Universe*.\nI promoted the album on 2023/07/23 by distributing it in Ximending, and attempted an island-wide distribution on 2023/07/29, which was canceled due to a typhoon.\nOn 2023/09/09, I hosted the live show *Instrumentality of Dream Vol.1*, with venue and equipment support from Ru-Meng.\nOn 2023/09/30, I made it to the Top 20 in the second round of the Central-Assemble Competition Season 4.\nOn 2024/11/16, I qualified for the Top 40 in Ru-Meng's *Little Hip-Hop Era* competition.\nOn 2025/04/13, I advanced to the Top 10 in *MadStreet: Leading To Your Dream*, starting from 180 participants.\nFinally, on 2025/04/30, I released my forth album *Still Childish* across all major streaming platforms.",
    "partFour": "Life Mottos:\nCourage is not the absence of fear, but moving forward despite it.\nCuriosity might kill me—but without it, this world might as well.\nStay alert for every challenge, and stay passionate too.\nFailures exist as part of the path to success.\nHave the courage to face your flaws, and always acknowledge your strengths.\nWithout realizing it, we've already been given so, so much.\nThe harder you strive to learn, the more vividly the world blooms before your eyes.",
    "partFive": "Sometimes, friends say things like:\n\"Wow, you taught yourself so much.\"\n\"You’re doing the job of an entire team.\"\n\"How can you be both a logical engineer and an emotional rapper?\"\nThe truth is, I live on both extremes.\nI cry easily over songs or films,\nyet remain unnervingly calm in chaotic moments.\nGrowing up taught me how to switch emotional gears,\nbut adulthood taught me something more valuable—awareness.\nInside, my emotions are often overwhelming.\nSmall feelings echo loudly in me.\nBut we all have roles to play, and mine often demands control.\nSensitivity fuels my empathy, my art, and my ability to connect.\nRationality gives me structure, helps me shape inspiration into music,\nand shields me from emotional burnout or harm.\nThe two don’t fight each other—they complete each other."
  }
}
